SteveKang1991/xiaozhi-esp32/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y

# ESP-Hosted Wi-Fi Remote Configuration
# Select ESP32-C6 as the co-processor for Wi-Fi/BT
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y

# SDIO queue sizes - reduce to prevent DMA memory exhaustion
CONFIG_ESP_HOSTED_SDIO_TX_QUEUE_SIZE=8
CONFIG_ESP_HOSTED_SDIO_RX_QUEUE_SIZE=8

# ESP-Hosted memory pool: use PSRAM for large DMA buffers (ESP32-P4 has limited internal RAM)
CONFIG_ESP_HOSTED_USE_MEMPOOL=y
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y

# Bluetooth - Bluedroid Host, Controller on ESP32-C6 co-processor
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y

# ESP-Hosted Bluedroid HCI over VHCI
CONFIG_ESP_HOSTED_ENABLE_BT_BLUEDROID=y
CONFIG_ESP_HOSTED_BLUEDROID_HCI_VHCI=y

# Wi-Fi Remote Buffer Configuration (Recommended for ESP-Hosted)
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64

# LWIP TCP Buffer Configuration (Recommended)
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534

CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024

# LVGL Graphics
CONFIG_LV_USE_SNAPSHOT=y
